package tenxun

import (
	"fmt"
	"io/ioutil"
	"net/http"
)

func CreateTenxun()  {
	url := "http://qt.gtimg.cn/q=sh000001"
	method := "GET"

	client := &http.Client {
	}
	req, err := http.NewRequest(method, url, nil)

	if err != nil {
		fmt.Println(err)
		return
	}
	req.Header.Add("Content-Type", "application/ecmascript")

	res, err := client.Do(req)
	if err != nil {
		fmt.Println(err)
		return
	}
	defer res.Body.Close()

	body, err := ioutil.ReadAll(res.Body)
	if err != nil {
		fmt.Println(err)
		return
	}
	fmt.Println(string(body))
}

// 0: 'v_sz000001="51', 未知
// 1: '平安银行',名称
// 2: '000001',代码
// 3: '13.34',最新价格
// 4: '13.24',昨收
// 5: '13.34',开盘
// 6: '1217006', 成交量（手）
// 7: '639545',外盘（手）
// 8: '577461',内盘（手）
// 9: '13.33',买一
// 10: '9983',买一量（手）
// 11: '13.32',买二
// 12: '1465',买二量（手）
// 13: '13.31',买三
// 14: '584',买三量（手）
// 15: '13.30',买四
// 16: '3131',买四量（手）
// 17: '13.29',买五
// 18: '1164',买五量（手）
// 19: '13.34',卖一
// 20: '5487',卖一量（手）
// 21: '13.35',卖二
// 22: '7173',卖二量（手）
// 23: '13.36',卖三
// 24: '3489',买三量（手）
// 25: '13.37',卖四
// 26: '3720',卖四量（手）
// 27: '13.38',卖五
// 28: '2968',卖五量（手）
// 29: '', 最新逐笔成交
// 30: '20200728152203',请求时间
// 31: '0.10',涨跌
// 32: '0.76',涨幅
// 33: '13.43',最高
// 34: '13.18',最低
// 35: '13.34/1217006/1618089559',最新价/成交量（手）/成交额（元）
// 36: '1217006',成交量（手）
// 37: '161809',成交额（万）
// 38: '0.63',换手率
// 39: '8.84',ttm市盈率
// 40: '',无内容
// 41: '13.43',最高
// 42: '13.18',最低
// 43: '1.89',振幅
// 44: '2588.73',流通市值（亿）
// 45: '2588.75',总市值（亿）
// 46: '0.93',lf市净率
// 47: '14.56',涨停价
// 48: '11.92',跌停价
// 49: '0.73',量比
// 50: '-6510',
// 51: '13.30',均价
// 52: '7.57',动态市盈率
// 53: '9.18',静态市盈率
// 54: '',无内容
// 55: '',无内容
// 56: '1.21',
// 57: '161808.9559',成交额（万）
// 58: '0.0000',
// 59: '0',
// 60: ' ',
// 61: 'GP-A',
// 62: '-17.81',
// 63: '',
// 64: '1.63',
// 65: '8.31',
// 66: '0.71"'

